Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-19-25.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་སངས་རྒྱས་མཐའ་ཡས་པ་མཐོང་བ་ལ་ཞུགས་པ།
en: Samanta­netra Sudhana, the head merchant’s son, had perceived the visions of infinite buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་པ་དང་འགྲོགས་པ་རབ་ཏུ་ཐོབ་པ།
en: He had attained the companionship of infinite bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་མཐའ་ཡས་པའི་ཚུལ་གྱིས་སྣང་བར་གྱུར་བ།
en: He had been illuminated by the infinite ways of the paths of the bodhisattvas.

source: ཆོས་ཀྱི་ཚུལ་མཐའ་ཡས་པས་མངོན་པར་བརླན་པས་ཤིན་ཏུ་རྟོགས་པའི་སེམས་དང་ལྡན་པ། བྱང་ཆུབ་སེམས་དཔའི་མོས་པ་མཐའ་ཡས་པའི་ལམ་གྱིས་རྣམ་པར་དག་པ།
en: His mind had certainty through being saturated by the infinite ways of the Dharma of the bodhisattvas. He purified the path of the infinite motivations of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་མཐའ་ཡས་པའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: He had attained the brilliance of the infinite faculties of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་མཐའ་ཡས་པའི་སྟོབས་ལ་གནས་པ།
en: He dwelled in the infinite aspirations of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཐའ་ཡས་བའི་རྗེས་སུ་སོང་བའི་སེམས་དང་ལྡན་པ།
en: His mind followed the example of the infinite conduct of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་མཐའ་ཡས་པའི་སྟོབས་ཡོངས་སུ་སྐྱེས་པ། བྱང་ཆུབ་སེམས་དཔའ་གཞན་གྱིས་ཐུབ་པ་མྱེད་པ།
en: He possessed the banner of the infinite invincibility of the bodhisattvas.

source: མཐའ་ཡས་བའི་རྒྱལ་མཚན་ཅན། བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་སྣང་བ་མཐའ་ཡས་པའི་རྒྱུད་དང་ལྡན་པ།
en: He possessed the movement of the infinite light of wisdom of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་མཐའ་ཡས་པའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ་དེ་མཐར་གྱིས་ཡུལ་སྦའི་རྩ་བ་གང་ན་བ་དེར་ཕྱིན་ནས།
en: He had attained the infinite illumination of the Dharma of the bodhisattvas.

source: གྲོང་ཁྱེར་ཀུན་ནས་སྒོ་ཡོངས་སུ་ཚོལ་ཞིང་ཕྱོགས་དང་། ཕྱོགས་མཚམས་དང་། ཡུལ་ཕྱོགས་ཉེན་ཀོར་ཀུན་དང་། སྒང་དང་གཤོང་དང་། མཉམ་པ་དང་མྱི་མཉམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་སྐྱོ་བ་མྱེད་པའི་བསམ་པ་དང་། འཇིགས་པ་མྱེད་པའི་སེམས་དང་། ལྡོག་པ་མྱེད་པའི་བརྩོན་འགྲུས་དང་། ཐུབ་པ་མྱེད་པའི་སེམས་ཀྱིས།
en: Sudhana eventually arrived in the land of Vetramūlaka, and he searched everywhere for the town of Samanta­mukha, unwearyingly, fearlessly, and with unflagging diligence and an inviolable determination. He searched in the principal and intermediate directions, the districts and subdistricts, high and low, up and down.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་མ་བརྗེད་པ་དང་། རྟག་ཏུ་དགེ་བའི་བཤེས་གཉེན་གྱི་སྤྱོད་པ་མ་ནོར་བས་སེམས་རབ་ཏུ་བསྒོས་པ་དང་། སྒོ་ཀུན་ནས་རྣམ་པར་དམྱིགས་པའི་དབང་པོ་དང་ལྡན་པ་དང་། བག་མྱེད་པ་ཐམས་ཅད་དང་བྲལ་བ་དང་། མྱིག་དང་རྣ་བ་གཡེང་བ་མྱེད་པར་ཀུན་ཏུ་ཚོལ་ཚོལ་ནས་ཡུལ་སྤའི་རྩ་བའི་དབུས་ཤིག་ན།
en: He never forgot the instructions of the kalyāṇamitras, always keeping the perfect conduct of the kalyāṇamitras in his heart, possessing the faculties that were all observant, devoid of all carelessness, his eyes and his ears never distracted. Having searched everywhere, Sudhana finally saw, in the center of the land of Vetramūlaka, the town of Samanta­mukha.

source: གྲོང་ཁྱེར་ཀུན་ནས་སྒོ་ཚོང་འདུས་ཀྱི་རྡལ་སྟོང་ཕྲག་བཅུའི་གནས་སུ་གྱུར་པ།
en: It was a town with ten thousand marketplaces.

source: དེ་ཤིན་ཏུ་བཟང་པོར་གྲུབ་པ།
en: It was excellently built.

source: རབ་བརྟན་པས་བསྐོར་བ།
en: It was encircled by a strong wall that was very high.

source: ཤིན་ཏུ་མཐོ་བ་བཞི་མདོ་བརྒྱད་ཀྱིས་བརྒྱན་པ་འདུག་པར་མཐོང་སྟེ།
en: It was beautified by having eight crossroads.

source: དེའི་ནང་ན་སྤོས་འཚོང་ཀུན་ཏུ་ལྟ་བ་ཡང་སྤོས་འཚོང་གི་ཁྱམས་ཤིག་ན་འདུག་པ་མཐོང་ནས།
en: In the middle of the town, Sudhana, the head merchant’s son, saw the perfume seller Samanta­netra in a perfume shop.

source: སྤོས་འཚོང་ཀུན་ཏུ་ལྟ་བ་གང་ན་བ་དེར་ཕྱིན་ཏེ། སྤོས་འཚོང་ཀུན་དུ་ལྟ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། མདུན་དུ་འདུག་སྟེ།
en: He approached the perfume seller Samanta­netra, bowed his head to Samanta­netra’s feet, and sat down before him.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་མཚལ་ཏོ།
en: With his hands together in homage, he said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ།
en: Samanta­netra said, “Noble one, it is excellent, excellent that you have developed the aspiration for the highest, complete enlightenment.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནད་ཤེས་ཏེ།
en: “Noble one, I know the illnesses of all beings:

source: རླུང་ལས་གྱུར་པ་དང་། མཁྲིས་པ་ལས་གྱུར་པ་དང་། བད་ཀན་ལས་གྱུར་པ་དང་། ཆ་མཉམ་པར་འཁྲུགས་པ་དང་། གཞན་གྱིས་གནོད་པར་བྱས་པ་དང་། མི་མ་ཡིན་པ་ལས་གྱུར་པ་དང་། དུག་འཐུངས་པ་དང་། སྔགས་དང་། མཚོན་དང་། རོ་ལངས་པའི་སྦྱོར་བ་སྣ་ཚོགས་དང་། མེ་ལས་གྱུར་པ་དང་། ཆུས་བསྐྱོད་པ་ལས་གྱུར་པ་དང་། སྔངས་པ་དང་འཇིགས་པ་སྣ་ཚོགས་ལས་གྱུར་པ་ཐམས་ཅད་ཀྱང་ཤེས་སོ།
en: those that come from air, those that come from bile, those that come from phlegm, those that come from their balance being disturbed, those that come from harm by others, and those that come from nonhuman beings, from drinking poison, from the effects of various mantras, weapons, and vetālas, from the agitation of water, and from various fears and terrors. I know them all.

source: ནད་དེ་དག་ཐམས་ཅད་ཞི་བར་བྱ་བ་ཡང་ཤེས་ཏེ། འདི་ལྟར་སྣུམ་པར་བྱ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: I also know how to cure all those illnesses.

source: །སྐྱུག་པར་བྱ་བ་དང་། བཀྲུ་བ་དང་། བརྟ་བ་དང་། གཏར་བ་དང་། སྣའི་ཆོ་ག་དང་། ཉ་ར་དང་། དུགས་དང་། ལུམས་དང་། བྱུག་པ་དང་། དུག་གསོ་བ་དང་། འབྱུང་པོའི་གདོན་མྱེད་པར་བྱ་བ་དང་། བཅུད་དང་། ཁྲུས་དང་། བཞག་པ་དང་། བསྐྱེད་པ་དང་། ཁ་དོག་སྦྱང་བ་དང་། ཉམ་བསྟོད་པའང་རབ་ཏུ་ཤེས་ཏེ།
en: I know oiling, emetics, purgatives, enemas, bloodletting, inhalations, sweating, compresses, unguents, massaging, antidotes, exorcisms, nourishment, bathing, resting, causing growth, purifying the complexion, and increasing strength.

source: རིགས་ཀྱི་བུ་ཕྱོགས་བཅུ་ནས་སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་ཁོ་བོའི་དྲུང་དུ་འོང་བ་དེ་དག་ཐམས་ཅད་ཀྱི་ནད་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཞི་བར་བྱེད་དེ།
en: “Noble one, I cure all the illnesses of all the beings who come to me from the ten directions.

source: ནད་སོས་ནས་ཀྱང་ལེགས་པར་བཀྲུ་བ་དང་ལུས་ལ་བྱུག་པས་བྱུག་པ་བྱས་ནས། ཅི་ཚུལ་གྱི་རྒྱན་གྱིས་ཡན་ལག་ཤིན་ཏུ་བརྒྱན་ཏེ། ཅི་རིགས་པའི་གོས་ལུས་ལ་བསྐོན་ནས།
en: When I have healed them, I have them bathed, their bodies anointed with unguents, their limbs adorned with jewelry, and their bodies dressed in clothes;

source: ཁ་ཟས་བྲོ་བའི་མཆོག་དང་ལྡན་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱས་ཏེ། ནོར་དཔག་ཏུ་མེད་པས་ཀྱང་ཕུན་སུམ་ཚོགས་པར་བྱེད་དོ།
en: I satisfy them with foods that have various kinds of excellent flavors and make them fortunate with immeasurable wealth.

source: །དེའི་འོག་ཏུ་ཡང་དེ་དག་ལ་མི་གཙང་བ་བསྟན་ཅིང་། །འདོད་ཆགས་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: “Afterward I teach them the Dharma so that through being taught impurity they will eliminate desire.

source: བྱམས་པ་ཆེན་པོ་ཡོངས་སུ་བསྔགས་ཤིང་ཞེ་སྡང་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: “I teach them the Dharma so that through the praising of love they will eliminate anger.

source: །ཆོས་རྣམ་པར་དབྱེ་བའི་བྱེ་བྲག་བསྟན་ཅིང་གཏི་མུག་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: “I teach them the Dharma so that through the teaching of the particular categories of phenomena they will eliminate ignorance.

source: ཁྱད་པར་ཁོང་དུ་ཆུད་པའི་ཚུལ་གྱི་སྒོ་ཡང་དག་པར་བསྟན་ཅིང་ཆ་མཉམ་པའི་སྤྱོད་པ་དང་། ཉོན་མོངས་པ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: “I teach them the Dharma so that through the teaching of the gateways to the ways of special realizations they will eliminate the conduct that comes from all kleśas equally.

source: །སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱི་ཆོས་དང་ལྡན་པའི་གཏམ་ཐམས་ཅད་ཡོངས་སུ་བརྗོད་ཅིང་བྱང་ཆུབ་ཀྱི་སེམས་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ། །འཁོར་བའི་སྡུག་བསྔལ་ཚད་གཟུང་དུ་མྱེད་པ་ཡོངས་སུ་བསྟན་ཅིང་།
en: “I elucidate for them the cause for the arising of the aspiration for enlightenment by relating to them descriptions of the phenomena that are the qualities of the buddhas.

source: སྙིང་རྗེ་ཆེན་པོ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach them the cause for the arising of great compassion by teaching them the immeasurable sufferings of saṃsāra.

source: །བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་རྒྱ་ཆེན་པོ་བསྩགས་པ་ཡང་དག་པར་བསྔགས་ཤིང་ཡོན་ཏན་ཚད་མེད་པ་འཐོབ་པ་དང་། འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach them the cause for the arising and attainment of measureless qualities by praising the gathering of a vast accumulation of merit and wisdom.

source: །སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བར་བྱ་བ་ཡོངས་སུ་བསྟན་ཅིང་ཐེག་པ་ཆེན་པོའི་སྨོན་ལམ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach them the cause for the arising of Mahāyāna prayers by teaching them how all beings should be ripened and guided.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དང་། བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པར་བྱ་བའི་སྤྱོད་པའི་དྲ་བ་ཤིན་ཏུ་རྒྱས་པར་བཤད་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་འཐོབ་པ་དང་། འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach them the cause for the arising and attainment of the completely good conduct of the bodhisattva by explaining the vast net of their conduct of dwelling in all buddha realms and all kalpas.

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བསྔགས་ཤིང་མཚན་དང་དཔེ་བྱད་བཟང་པོས་བརྒྱན་པའི་སངས་རྒྱས་ཀྱི་སྐུ་འཐོབ་པ་དང་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach them the cause for the arising and attainment of a buddha’s body adorned with the signs and features of a great being by praising the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཡོངས་སུ་དག་པ་ཐམས་ཅད་དུ་འགྲོ་བ་འཐོབ་པ་དང་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach them the cause for the arising and attainment of the pure tathāgata’s body that can be anywhere by describing the perfection of good conduct.

source: །བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་དང་། སྐུ་མདོག་རྣམ་པར་དག་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྒྱུ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach them the cause for the arising and attainment of the tathāgata’s body with its inconceivable, pure color by describing the perfection of patience.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཐུབ་པར་དཀའ་བ་ཡོངས་སུ་སྟོན་ཏོ།
en: I teach them the cause for the arising and attainment of the tathāgata’s invincible body by describing the perfection of diligence.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཟིལ་གྱིས་གནོན་ལ།
en: “I teach them the cause for the arising and attainment of the tathāgata’s pure body, which is unsurpassable and overwhelming, by describing the perfection of meditation.

source: ཟིལ་གྱིས་གནོན་པ་རྣམ་པར་དག་པ་ཡོངས་སུ་སྟོན་ཏོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་ཆོས་ཀྱི་སྐུ་ཡོངས་སུ་དག་པ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach the pure Dharma body by describing the perfection of wisdom.

source: །ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་འགྲོ་བ་ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་པའི་སྐུ་གཙང་ཞིང་རྣམ་པར་དག་པ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach the pure and pristine body manifesting to all beings by describing the perfection of skillful method.

source: །སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་བསྐལ་པ་ཐམས་ཅད་ཀྱི་དུས་སུ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་དང་འགྲོགས་པའི་སྐུ་རྣམ་པར་དག་པ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach the pure body that accompanies the minds of beings during all kalpas by describing the perfection of prayer.

source: །སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་མངོན་པར་འབྱུང་བའི་སྐུ་རྣམ་པར་དག་པ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach the pure bodies that arise in all buddha realms by describing the perfection of strength.

source: །ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་འགྲོ་བ་ཐམས་ཅད་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚིམ་པར་མཛད་པའི་སྐུ་རྣམ་པར་དག་པ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach the pure bodies that satisfy all beings in accordance with their wishes by describing the perfection of knowledge.

source: །མྱི་དགེ་བའི་ཆོས་ཐམས་ཅད་ལས་རྣམ་པར་ལྡོག་པ་ཡོངས་སུ་བརྗོད་ཅིང་བལྟ་ན་ཕུལ་དུ་བཟང་བའི་སྐུ་རྣམ་པར་དག་པ་ཡོངས་སུ་སྟོན་ཏོ།
en: “I teach the pure body that is the highest goodness by describing the rejection of all bad qualities.

source: །དེ་ལྟར་དེ་དག་ཆོས་ཀྱི་སྦྱིན་པས་ཡོངས་སུ་བསྡུས་ཏེ།
en: “In that way, those comprise the generosity of giving the Dharma.

source: ནོར་དང་རིན་པོ་ཆེ་མཐའ་ཡས་པའི་ཚོགས་ཀྱིས་ཉེ་བར་བརྟན་པ་བྱས་ཤིང་སོ་སོར་འགྱེད་དོ།
en: I also support them by distributing an accumulation of endless wealth and jewels.

source: །ཡང་རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་སྤོས་དང་། བདུག་སྤོས་དང་། བསྒོ་བ་དང་། བསྐུ་བ་སྦྱོར་ཤེས་ཏེ།
en: “Noble one, I also know about all perfumes, incenses, aromas, infusions, ointments, and their combinations. “In that way, I know all combinations of perfumes:

source: འདི་ལྟར་སྤོས་ཀྱི་རྒྱལ་པོ་གཞལ་དུ་མེད་པ་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་སིནྡུ་བ་ར་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་མི་ཕམ་པ་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་རྣམ་པར་གསལ་བྱེད་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་ཉི་མ་ཡོད་པ་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་དུས་དང་འཐུན་པ་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་སྦྲུལ་གྱི་སྙིང་པོའི་ཙན་དན་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་སྤྲིན་གྱི་ཨ་ག་རུ་ལ་སྩོགས་པ་དང་། སྤོས་ཀྱི་རྒྱལ་པོ་དབང་པོ་མི་འཁྲུག་པ་ལ་སྩོགས་པ།
en: kings of perfumes such as sesame, kings of perfumes such as chaste tree, kings of perfumes such as ajivāti , kings of perfumes such as vibodhana , kings of perfumes such as aruṇavati , kings of perfumes such as yellow sandalwood, kings of perfumes such as uragasāra sandalwood, kings of perfumes such as cloud agarwood, and kings of perfumes such as akṣobhyendriya

source: སྤོས་སྦྱར་བ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཤེས་སོ། །ཡང་རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་དང་། སྒོ་ཐམས་ཅད་ནས་སངས་རྒྱས་བལྟ་ཞིང་མཆོད་པ་དང་། བསྙེན་བཀུར་བའི་སྤོས་ཀྱི་གཟུགས་ཤེས་ཏེ།
en: “Also, noble one, I know the kind of perfume that will satisfy all beings and through which one sees, makes offering to, and honors the buddhas anywhere.

source: རིགས་ཀྱི་བུ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་དང་། སྒོ་ཐམས་ཅད་ནས་སངས་རྒྱས་བལྟ་ཞིང་མཆོད་པ་དང་། བསྙེན་བཀུར་བའི་སྤོས་ཀྱི་གཟུགས་འདིས་ཁོ་བོའི་བསམ་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “Noble one, through this kind of perfume that will satisfy all beings and through which one sees, makes offering to, and honors the buddhas anywhere, all of my wishes are fulfilled.

source: དེའི་མཐུས་ཁོ་བོ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པའི་རྒྱན་གྱི་སྤྲིན་བྱིན་གྱིས་རློབ་པ་བྱེད་དེ་འདི་ལྟར་སྤོས་ཀྱི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱི་རྒྱན་ནས་རྣམ་པ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བའི་རྒྱན་གྱི་སྤྲིན་གྱི་བར་དུ་བྱིན་གྱིས་རློབ་པ་བྱེད་དོ།
en: Through its power I manifest clouds of adornments that will protect all beings. In that way, I manifest clouds of perfume that form aerial palaces and so on, up to clouds of adornments that venerate and make offerings to all the tathāgatas.

source: །རིགས་ཀྱི་བུ་ཁོ་བོ་ན་ནི་མ་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱ་བར་འདོད་པར་གྱུར་པ་དེའི་ཚེ། ཁོ་བོས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་དང་། སྒོ་ཐམས་ཅད་ནས་སངས་རྒྱས་བལྟ་ཞིང་མཆོད་པ་དང་། བསྙེན་བཀུར་བའི་སྤོས་ཀྱི་གཟུགས་འདི་ལས་སྤོས་ཀྱི་མཛོད་ཀྱི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་ཚད་གཟུང་དུ་མྱེད་པ་བཏོན་ཅིང་། ཕྱོགས་བཅུའི་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ན་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་སྤོས་ཐམས་ཅད་ཀྱི་མཛོད་ཀྱི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱི་རྒྱན་བྱིན་གྱིས་རློབ་པ་བྱེད་དོ།
en: “Thus, noble one, when I wish to make offerings to the tathāgatas, then from this form of perfume that will satisfy all beings and through which one sees, makes offering to, and honors the buddhas anywhere, I manifest clouds of perfume that form countless kūṭāgāras, and throughout the realm of phenomena I manifest clouds of perfume in the form of kūṭāgāras that adorn the assemblies of the followers of the tathāgatas present throughout the realm of phenomena in the ten directions.

source: །ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་སྦྱོང་བའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་ཁང་པའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་ར་བའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་བ་གམ་གྱི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་རྟ་བབས་ཀྱི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་སྐར་ཁུང་གི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་པུ་ཤུའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་ཟླ་གམ་གྱི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་གདུགས་ཀྱི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་རྒྱལ་མཚན་བསྒྲེང་བའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་ལྷའི་བ་དན་གྱི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་བླ་བྲེའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་གཟུགས་ཀྱི་དྲ་བའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་འོད་ཀྱི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཀྱི་སྣང་བ་དྲི་མ་མྱེད་པའི་སྤྲིན་གྱི་རྒྱན་དང་། སྤོས་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་བྱིན་གྱིས་རློབ་སྟེ།
en: “All the pure buddha realms become adorned by clouds, an adornment of clouds as palaces of perfume, an adornment of clouds as walls of perfume, an adornment of clouds as ornamental roofs of perfume, an adornment of clouds as toraṇas of perfume, an adornment of clouds as windows of perfume, an adornment of clouds as balconies of perfume, an adornment of clouds as a crescent moon of perfume, an adornment of clouds as parasols of perfume, an adornment of clouds as erected banners of perfume, an adornment of clouds as flags of perfume, an adornment of clouds as canopies of perfume, an adornment of clouds as nets of strings of beads of perfume, an adornment of clouds as lights of perfume, an adornment of clouds as a display of the stainless radiances of perfume, and an adornment of rain from clouds of all perfume.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་དང་། སྒོ་ཐམས་ཅད་ནས་སངས་རྒྱས་བལྟ་ཞིང་མཆོད་པ་དང་། བསྙེན་བཀུར་བའི་སྤོས་ཀྱི་གཟུགས་ཀྱི་ཆོས་ཀྱི་སྒོ་འདི་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་སྨན་གྱི་རྒྱལ་པོ་ལྟ་བུར་གྱུར་པ། བལྟ་ན་དོན་ཡོད་པ། འགྲོགས་ན་དོན་ཡོད་པ། རྗེས་སུ་དྲན་ན་དོན་ཡོད་པ། བརྟུལ་ཞུགས་རྗེས་སུ་བྱས་ན་དོན་ཡོད་པ། མྱིང་ཐོས་ན་དོན་ཡོད་པ། མཐོང་པ་ཙམ་གྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་ཞི་བར་འགྱུར་བ།
en: “Noble one, I know only this Dharma gateway called the forms of perfume that satisfy all beings and through which in every way one sees, makes offerings to, and honors the buddhas

source: མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་ངན་སོང་གི་རྒྱུད་ལས་ལྡོག་པར་འགྱུར་བ། མཐོང་པ་ཙམ་གྱིས་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཆོས་ལ་སྐབས་ཕྱེ་བ་ཐོབ་པར་གྱུར་པ། མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཐམས་ཅད་ཞི་བར་འགྱུར་བ་མཐོང་ཙམ་གྱིས་སེམས་ཅན་ཐམས་ཅད་འཇིགས་པ་དང་། འཁོར་བའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ཀྱི་འཇིགས་པ་དང་བྲལ་བར་འགྱུར་བ་མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་ཐམས་ཅད་མཁྱེན་པའི་ཕྱོགས་ལ་རྟེན་པར་འགྱུར་བའི་ཕྱིར་མྱི་འཇིགས་པ་ཐོབ་པར་འགྱུར་བ། མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་རྒ་ཤིའི་གྲོག་པོ་དང་གཡང་སར་མི་ལྟུང་བ། མཐོང་བ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་ལ་གནས་པས་མྱ་ངན་ལས་འདས་པའི་བདེ་བ་འཐོབ་པར་འགྱུར་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ་ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: How could I know the conduct or describe the qualities of the bodhisattvas who are like kings of medicine, who are beneficial to see, who are beneficial to be with, who are beneficial to think of, whose self-discipline is beneficial to follow, whose names are beneficial to hear, the mere sight of whom causes the kleśas of all beings to cease, the mere sight of whom causes beings to turn away from the existences in the lower realms, the mere sight of whom causes all beings to gain the opportunity to receive the Buddhadharma, the mere sight of whom causes the mass of suffering of beings to end, the mere sight of whom causes all beings to be free of the fear of all the existences in saṃsāra, the mere sight of whom causes all beings to be resolute in going in the direction of omniscience and therefore attain fearlessness, the mere sight of whom causes beings not to fall into the crevasse or chasm of old age and death, and the mere sight of whom causes beings to rest in the equality of the realm of phenomena and therefore attain the bliss of nirvāṇa? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་ཏ་ལའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a town called Tāladhvaja.

source: དེ་ན་རྒྱལ་པོ་མེ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells a king by the name of Anala.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: ཚོང་དཔོན་སྤོས་འཚོང་ཀུན་ཏུ་བལྟ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཚོང་དཔོན་སྤོས་འཚོང་ཀུན་ཏུ་བལྟ་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། ཚོང་དཔོན་སྤོས་འཚོང་ཀུན་ཏུ་བལྟ་བའི་དྲུང་ནས་སོང་ངོ་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the perfume-seller head merchant Samanta­netra, circumambulated the perfume-seller head merchant Samanta­netra many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the perfume-seller head merchant Samanta­netra.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་བཤེས་གཉེན་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་དེ་དག་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་།
en: Sudhana, the head merchant’s son, remembered the succession of his kalyāṇamitras.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་གི་སྒོ་དེ་དག་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། བདག་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་ངོ་།
en: He thought about the gateways of their instructions.

source: །ཞེས་རང་གི་སེམས་ཡོངས་སུ་ཚིམ་པར་བྱ་བ་དང་། བདག་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བསྲུངས་པས། ང་ནི་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་པར་ཡང་མྱི་འགྱུར་རོ། །སྙམ་དུ་རྣམ་པར་སེམས་ཤིང་། སེམས་དགའ་བ་ནི་རབ་ཏུ་ཐོབ། སེམས་དང་བ་དང་སེམས་རབ་ཏུ་དགའ་བ་དང་། སེམས་རངས་པ་དང་། སེམས་མགུ་བ་དང་། སེམས་མོས་པ་དང་། སེམས་ཀྱི་ཤུགས་དང་། སེམས་རྣམ་པར་ཞི་བ་དང་། སེམས་རྒྱ་ཆེན་པོ་དང་། སེམས་ཀྱི་རྒྱན་དང་། སེམས་ལ་ཐོགས་པ་མྱེད་པ་དང་སེམས་ལ་སྒྲིབ་པ་མྱེད་པ་དང་། སེམས་རྣམ་པར་ཕྱེ་བ་དང་། སེམས་ཡང་དག་པར་གཞོལ་བ་དང་། སེམས་ཀྱི་དབང་དང་། སེམས་དབང་སྒྱུར་བ་དང་། སེམས་ཀྱི་ཆོས་ཁོང་དུ་ཆུད་པ་དང་། སེམས་ཀྱིས་ཞིང་རྒྱས་བར་དགང་བ་དང་། སེམས་སངས་རྒྱས་མཐོང་བས་བརྒྱན་པ་དང་། སེམས་སྟོབས་བཅུའི་ཡིད་ལ་བྱ་བ་དང་མི་འབྲལ་བའང་ཐོབ་ནས།
en: He was content in his mind, thinking, “I have been accepted as a pupil by the kalyāṇamitras.” He observed in his mind, “I am under the protection of the kalyāṇamitras, and I will never regress in my progress toward the highest, complete enlightenment.” Thinking this, his mind was happy, his mind was serene, his mind was pleased, his mind was gladdened, his mind was delighted, his mind was joyful, his mind was strong, his mind was soothed, his mind was vast, his mind was adorned, his mind was unimpeded, his mind was unobscured, his mind was clear, his mind was composed, his mind had power, his mind had supremacy, his mind comprehended the Dharma, his mind pervaded the realms, his mind was adorned by the vision of the buddhas, and his mind never stopped focusing on the ten strengths.

source: དེ་མཐར་ཀྱིས་ལྗོངས་ནས་ལྗོངས་དང་། གྲོང་ནས་གྲོང་དང་། ཡུལ་ནས་ཡུལ་དུ་ཚོལ་ཞིང་གྲོང་ཁྱེར་ཏ་ལའི་རྒྱལ་མཚན་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Sudhana went from land to land, town to town, district to district, and eventually he reached the town of Tāladhvaja.

source: རྒྱལ་པོ་མེ་གང་ན་བཞུགས་ཞེས་དྲིས་ན།
en: He asked, “Where is King Anala?”

source: དེ་ལ་འགྲོ་བ་གཞན་དག་གིས་འདི་སྐད་དུ་བསྟན་ཏེ། རིགས་ཀྱི་བུ་འདེ་རེ་རྒྱལ་པོ་མེ་ནི་རྒྱལ་པོའི་དོན་བསྒྲུབ་པའི་ཕྱིར་སེང་གེའི་གདན་ལ་བཞུགས་ཤིང་།
en: People told him, “Noble one, King Anala sits on the lion throne here performing the activities of a king in order to accomplish the duties of a king.

source: རྒྱལ་པོའི་ཕྲིན་ལས་མཛད་དོ། །ཁམས་རབ་ཏུ་སྐྱོང་ངོ་།
en: He rules the realm.

source: །ཆད་པས་གཅད་པར་འོས་པ་ནི་ཆད་པས་གཅོད་དོ།
en: He penalizes those who deserve to be penalized.

source: བྱ་དགས་སྡུད་པར་འོས་པ་ནི་བྱ་དགས་སྡུད་དོ།
en: He favors those who should be favored.

source: གཡོན་ཡོད་པ་རྣམས་ལ་ནི་གྱོད་རྨེད་དོ།
en: He condemns criminals to punishment.

source: །རྩོད་པ་རྣམས་ཀྱི་ཞལ་ཅེ་ནི་ཡོངས་སུ་གཅོད་དོ།
en: He makes the decisions on legal disputes.

source: །དམའ་བ་རྣམས་ནི་དབུགས་འབྱིན་ཏོ།
en: He brings relief to those who are low.

source: །དྲེགས་པ་རྣམས་ནི་འདུལ་བ་མཛད་དོ།
en: He humbles the arrogant.
